Semana 07/Depuracion-Rails/myrottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    # begin
        id = params[:id] # retrieve movie ID from URI route
        # raise params.inspect
        byebug
        @movie = Movie.find(id) # look up movie by unique ID