Semana 09/PC4/Parte 5/myrottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    authorize_user!
    @movie = Movie.find params[:id]